In [1]:
import pandas as pd
data=pd.read_csv("deneme2.txt",sep=",", header=None, encoding="UTF-8")

In [4]:
data.columns=["şehir","plaka_no","nufus"]

In [5]:
data

      şehir  plaka_no  nufus
0     adana         1   8000
1    samsun        55   9000
2  istanbul        34  10000
3     konya        42   5000

In [9]:
data.drop("plaka_no", axis=1, inplace=True )
#inplace yazmazsanız silme kalıcı olmaz. True nun T si büyük olacak
#axis=0 satırı axis=1 sutunu ifade eder.

In [10]:
data

      şehir  nufus
0     adana   8000
1    samsun   9000
2  istanbul  10000
3     konya   5000